
&НаКлиенте
Процедура ДанныеПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Данные.ТекущиеДанные;
	
	Колво = 0;
	Если СтрокаТабличнойЧасти.Пн = 1 Тогда Колво = Колво + 1; КонецЕсли;
	Если СтрокаТабличнойЧасти.Вт = 1 Тогда Колво = Колво + 1; КонецЕсли;
	Если СтрокаТабличнойЧасти.Ср = 1 Тогда Колво = Колво + 1; КонецЕсли;
	Если СтрокаТабличнойЧасти.Чт = 1 Тогда Колво = Колво + 1; КонецЕсли;
	Если СтрокаТабличнойЧасти.Пт = 1 Тогда Колво = Колво + 1; КонецЕсли;
	СтрокаТабличнойЧасти.КоличествоТренировок = Колво;
	
КонецПроцедуры

