
&НаСервереБезКонтекста
Функция ВернутьДР(ФИО)
	Возврат ФИО.ДатаРождения;
                    
КонецФункции        


Функция ВернутьПол(ФИО)
	Возврат ФИО.Пол;

КонецФункции

 Функция ВернутьСекцию(ФИО)
	Возврат ФИО.Секции;

КонецФункции

 Функция ВернутьВозраст(ФИО)
	Возврат ФИО.Возраст;

КонецФункции



&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	Объект.ДатаРождения = ВернутьДР(Объект.ФИО);
	Объект.Пол = ВернутьПол(Объект.ФИО);
	Объект.Секции = ВернутьСекцию(Объект.ФИО);   
	Объект.Возраст = ВернутьВозраст(Объект.ФИО);   
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Источник)
    Если Не ЗначениеЗаполнено(Объект.ДатаРождения) Тогда
        ЭтотОбъект.Возраст = 0;
        Возврат;
    КонецЕсли;
    
    ТекущаяДата = ТекущаяДата();
    Возраст = ГОД(ТекущаяДата) - ГОД(Объект.ДатаРождения);
    
    Если (МЕСЯЦ(ТекущаяДата) < МЕСЯЦ(Объект.ДатаРождения)) Или 
       (МЕСЯЦ(ТекущаяДата) = МЕСЯЦ(Объект.ДатаРождения) И ДЕНЬ(ТекущаяДата) < ДЕНЬ(Объект.ДатаРождения)) Тогда
        Возраст = Возраст - 1;
    КонецЕсли;
    
    Объект.Возраст = Возраст;
КонецПроцедуры
