          Процедура ДатаРожденияПриИзменении(Элемент)
    Если Не ЗначениеЗаполнено(ДатаРождения) Тогда
        Возраст = 0;
        Возврат;
    КонецЕсли;
    
    ТекущаяДата = ТекущаяДата();
    Возраст = ГОД(ТекущаяДата) - ГОД(ДатаРождения);
    
    Если (МЕСЯЦ(ТекущаяДата) < МЕСЯЦ(ДатаРождения)) Или 
       (МЕСЯЦ(ТекущаяДата) = МЕСЯЦ(ДатаРождения) И ДЕНЬ(ТекущаяДата) < ДЕНЬ(ДатаРождения)) Тогда
        Возраст = Возраст - 1;
    КонецЕсли;
    
    ЭтотОбъект.Возраст = Возраст;
КонецПроцедуры


