&НаКлиенте
Процедура ДатаРожденияПриИзменении(Источник)
    Если Не ЗначениеЗаполнено(Объект.ДатаРождения) Тогда
        ЭтотОбъект.Возраст = 0;
        Возврат;
    КонецЕсли;
    
    ТекущаяДата = ТекущаяДата();
    Возраст = ГОД(ТекущаяДата) - ГОД(Объект.ДатаРождения);
    
    Если (МЕСЯЦ(ТекущаяДата) < МЕСЯЦ(Объект.ДатаРождения)) Или 
       (МЕСЯЦ(ТекущаяДата) = МЕСЯЦ(Объект.ДатаРождения) И ДЕНЬ(ТекущаяДата) < ДЕНЬ(Объект.ДатаРождения)) Тогда
        Возраст = Возраст - 1;
    КонецЕсли;
    
    Объект.Возраст = Возраст;
КонецПроцедуры