&НаСервере
Процедура ПередЗаписью(Отказ, РежимЗаписи)
	ДатаНачала = ЭтотОбъект.ДатаНачала;
	Год = Год(ДатаНачала);
	ЭтотОбъект.Год = Год;       
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Нагрузка Приход
	Движения.Нагрузка.Записывать = Истина;
	Для Каждого ТекСтрокаДанные Из Данные Цикл
		Движение = Движения.Нагрузка.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Секция = ТекСтрокаДанные.Секция;
		Движение.КоличествоТренировок = ТекСтрокаДанные.КоличествоТренировок * 52;
		Движение.КоличествоЧасовВГод = Движение.КоличествоТренировок * ТекСтрокаДанные.ПродолжительностьТренировки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
