&НаСервере
Процедура ПриЗаписи(ТекущийОбъект, ПараметрыЗаписи)

    // Проверяем, заполнен ли реквизит "Руководитель"
	Если ЗначениеЗаполнено(ЭтотОбъект.Руководитель) Тогда
        // Получаем объект Руководитель
        РуководительОбъект = ЭтотОбъект.Руководитель.ПолучитьОбъект();
        // Устанавливаем значение реквизита "Секция"
        РуководительОбъект.Секция = ЭтотОбъект.Ссылка;
        // Сохраняем изменения
        РуководительОбъект.Записать();
    КонецЕсли;
КонецПроцедуры
